var desc = {
    "1601661015583.jpg": "我们俩的第一张照片，太含蓄所以只拍了影子💑",
    "1601661015577.jpg": "生日那天，婧婧写给刘斯盾的第一封情书",
    "1601661015569.jpg": "婧婧送的生日蛋糕🎂",
    "1601661015563.jpg": "生日晚餐，一起去吃小炒黄牛肉，还有晚餐后辣辣的💋",
    "1601661015555.jpg": "岳麓山脚下，我们去吃绿绿的面面",
    "1601661015548.jpg": "婧婧给买的云南白药，崴脚也不怕啦",
    "1601661015426.jpg": "银杏叶黄的季节，婧婧去图书馆接刘斯盾下班",
    "1601661015533.jpg": "婧婧烤的肉也太好吃了叭",
    "1601661015525.jpg": "那天队值，孙小姐给刘先生留的小纸条",
    "1601661015519.jpg": "第一个学期结束啦，去吃云水谣~",
    "1601661015514.jpg": "婧婧钦点的向家人展示合照👫",
    "1601661015508.jpg": "假期分开的日子里，用照片分享彼此的生活",
    "1601661015502.jpg": "2020💗爱你爱你",
    "1601661015496.jpg": "婧婧和毛茸茸怪兽，还是婧婧更可爱~",
    "1601661015489.jpg": "情人节，刘斯盾写给婧婧的情书💌",
    "1601661015484.jpg": "情人节，婧婧写给刘斯盾的情书，一眼万年💌",
    "1601661015479.jpg": "超可爱的婧婧！那天婧婧喝了点🍷，更能聊了👀",
    "1601661015469.jpg": "那一天，终于见到你！",
    "1601661015467.jpg": "隔离期间，一顿费大厨外卖都能开心很久",
    "1601661015465.jpg": "终于出学校啦，吃豆人&条纹衫，还有乖巧的婧婧",
    "1601661015429.jpg": "婧婧住院😭可把我心疼坏了",
    "1601661015462.jpg": "270!更多的是责任",
    "1601661015459.jpg": "是彩虹的颜色💅🌈",
    "1601661015457.jpg": "我们在一起三百天啦",
    "1601661015454.jpg": "那一天的婧婧可太紧张了😨",
    "微信图片_20201003183930.jpg": "普通的一天，也是快乐的一天，有人说有夫妻相😁",
    "1601661015431.jpg": "胡萝卜小金条，不知道尝起来是什么味道的",
    "1601661015451.jpg": "今天是坐小火车的婧婧小朋友",
    "1601661015449.jpg": "草帽男孩带着他的女孩去看电影🎥",
    "1601661015446.jpg": "哇哦哦哦，七夕礼物是香水和可爱熊熊🐻",
    "1601661015444.jpg": "时间往复，爱你如初；情长纸短，吻你万千",
    "1601661015441.jpg": "谁能想到我们俩还是画家cp呢🖌",
    "1601661015439.jpg": "今天去唱歌🎙",
    "1601661015434.jpg": "甜心火龙果，婧婧就是小甜心呀",
    "1602241904914.jpg": "亲吻我的公主 甜蜜像吃泡芙💕",
    "1602241904909.jpg": "海螺公主回到了海螺湾",
    "1602241904904.jpg": "cool girl & cool guy",
    "1602241904898.jpg": "二人剪影",
}

$(function () {
    for (filename in desc) {
        $("#GallaryUl").append(`<li data-contenttype="image" data-href="image/${filename}" , data-text="${desc[filename]}">
    <img src="image/${filename}" />
</li>`)
    }
    wall.refresh()
});